[
    {
        "bookId": 1,
        "bookName": "The Silent Patient",
        "author": "Alex Michaelides",
        "image": "https://i.pinimg.com/236x/bd/29/34/bd293499ee09b8fa4182f2ae24d83133.jpg",
        "review": "The Silent Patient is a gripping psychological thriller that keeps you guessing until the very end. The story revolves around Alicia Berenson, a famous painter who murders her husband, Gabriel, and then stops speaking. Theo Faber, a psychotherapist, becomes obsessed with her case and is determined to uncover the truth behind her silence. As Theo delves deeper into Alicia's past, he uncovers dark secrets and shocking revelations that will leave you on the edge of your seat. With its twists and turns, The Silent Patient is a must-read for fans of psychological thrillers.",
        "totalPages": 336,
        "rating": 4.5,
        "category": "Mystery",
        "tags": ["Suspense", "Psychological"],
        "publisher": "Celadon Books",
        "yearOfPublishing": 2019
    },
    {
        "bookId": 2,
        "bookName": "The Night Circus",
        "author": "Erin Morgenstern",
        "image": "https://i.pinimg.com/236x/a0/37/5c/a0375c143d4f5990b8baa2e439fdd15f.jpg",
        "review": "The Night Circus is a beautifully crafted tale of magic and love, set within the mysterious world of a traveling circus. The story follows Celia and Marco, two young magicians bound by fate to compete in a magical competition where they must create wondrous enchantments in a magical circus that only appears at night. As Celia and Marco's rivalry intensifies, their magical creations become increasingly elaborate, captivating both the circus's audience and each other. But as their competition escalates, they soon realize that only one of them can emerge victorious, leading to a dramatic and unforgettable conclusion. With its mesmerizing prose and enchanting storyline, The Night Circus is a spellbinding read that will leave you breathless.",
        "totalPages": 400,
        "rating": 4.7,
        "category": "Fantasy",
        "tags": ["Magic", "Romance"],
        "publisher": "Doubleday",
        "yearOfPublishing": 2011
    },
    {
        "bookId": 3,
        "bookName": "Educated: A Memoir",
        "author": "Tara Westover",
        "image": "https://i.pinimg.com/736x/0c/50/6c/0c506ce676d7ca266f8074986ad11699.jpg",
        "review": "Educated: A Memoir is a powerful and inspiring story of resilience, determination, and the pursuit of education against all odds. Tara Westover recounts her extraordinary journey from growing up in a strict and isolated household in rural Idaho to eventually earning a PhD from Cambridge University. Along the way, she faces numerous challenges, including abuse, neglect, and the suppression of her own identity. Despite these obstacles, Tara finds the strength to break free from her past and forge her own path towards enlightenment and self-discovery. With its raw honesty and profound insights, Educated is a testament to the transformative power of education and the human spirit.",
        "totalPages": 352,
        "rating": 4.8,
        "category": "Memoir",
        "tags": ["Education", "Inspiring"],
        "publisher": "Random House",
        "yearOfPublishing": 2018
    },
    {
        "bookId": 4,
        "bookName": "Scholarship Monthly planner",
        "author": "George Orwell",
        "image": "https://i.pinimg.com/736x/79/d3/99/79d399ac5f7293614dc1f4ee96ab8abd.jpg",
        "review": "1984 is a dystopian masterpiece that remains as relevant today as it was when first published. Set in a totalitarian society where freedom of thought is suppressed, the novel follows Winston Smith, a low-ranking member of the ruling Party, as he rebels against the oppressive regime. As Winston begins to question the Party's propaganda and surveillance tactics, he risks his life to pursue forbidden relationships and ideas. However, his defiance comes with dire consequences, leading to a chilling and thought-provoking climax. With its haunting portrayal of government surveillance and thought control, 1984 serves as a warning against the dangers of authoritarianism and the erosion of individual freedoms.",
        "totalPages": 328,
        "rating": 4.6,
        "category": "Dystopian",
        "tags": ["Political", "Classic"],
        "publisher": "Secker & Warburg",
        "yearOfPublishing": 1949
    },
    {
        "bookId": 5,
        "bookName": "The Great Gatsby",
        "author": "F. Scott Fitzgerald",
        "image": "https://i.pinimg.com/736x/9c/8e/7b/9c8e7b31ec4f228e268927bc9b8ff9a2.jpg",
        "review": "The Great Gatsby is a timeless classic that captures the essence of the Jazz Age and the American Dream. Set in the summer of 1922, the novel follows the enigmatic Jay Gatsby as he pursues wealth, love, and status in pursuit of his elusive dream. Narrated by Nick Carraway, a young man from the Midwest who becomes embroiled in Gatsby's glamorous world, the story explores themes of love, loss, and the corrupting influence of wealth. With its vivid imagery, lyrical prose, and complex characters, The Great Gatsby is a poignant meditation on the pursuit of happiness and the emptiness of the American Dream.",
        "totalPages": 180,
        "rating": 4.4,
        "category": "Classic",
        "tags": ["Romance", "Tragedy"],
        "publisher": "Charles Scribner's Sons",
        "yearOfPublishing": 1925
    },
    {
        "bookId": 6,
        "bookName": "To Kill a Mockingbird",
        "author": "Harper Lee",
        "image": "https://i.pinimg.com/736x/1b/80/56/1b8056d39138f680c5c78cc3f0c6f4ff.jpg",
        "review": "To Kill a Mockingbird is a profound exploration of morality, racism, and innocence in the Deep South. Set in the fictional town of Maycomb, Alabama, during the 1930s, the novel follows Atticus Finch, a principled lawyer, as he defends a black man falsely accused of raping a white woman. Through the eyes of Scout Finch, Atticus's young daughter, the story examines themes of prejudice, justice, and the loss of innocence. With its timeless lessons and unforgettable characters, To Kill a Mockingbird continues to resonate with readers of all ages and backgrounds.",
        "totalPages": 336,
        "rating": 4.9,
        "category": "Fiction",
        "tags": ["Legal", "Social Justice"],
        "publisher": "J. B. Lippincott & Co.",
        "yearOfPublishing": 1960
    },
    {
        "bookId": 7,
        "bookName": "Pride and Prejudice",
        "author": "Jane Austen",
        "image": "https://i.pinimg.com/736x/1b/ce/57/1bce57ee5db99c2d6f832f10c2922943.jpg",
        "review": "Pride and Prejudice is a timeless classic that explores the complexities of love, marriage, and social class in early 19th-century England. The novel follows the protagonist, Elizabeth Bennet, as she navigates the societal expectations of her time while confronting her own prejudices and misconceptions. Along the way, she encounters the enigmatic Mr. Darcy, whose pride and aloofness initially repel her but ultimately reveal a depth of character and integrity. Through wit, humor, and keen observation, Jane Austen crafts a story that continues to captivate readers with its timeless themes and memorable characters.",
        "totalPages": 432,
        "rating": 4.7,
        "category": "Romance",
        "tags": ["Classic", "Love Story"],
        "publisher": "T. Egerton, Whitehall",
        "yearOfPublishing": 1813
    },
    {
        "bookId": 8,
        "bookName": "The Catcher in the Rye",
        "author": "J.D. Salinger",
        "image": "https://i.pinimg.com/736x/48/a0/7f/48a07f961b4fa85e8baf40fb136f8694.jpg",
        "review": "The Catcher in the Rye is a coming-of-age novel that explores themes of alienation, innocence, and identity. The story is narrated by Holden Caulfield, a disaffected teenager who struggles with the phoniness and hypocrisy he perceives in the adult world. Over the course of three days in New York City, Holden embarks on a journey of self-discovery, grappling with his grief over the loss of innocence and his fear of growing up. Through Holden's distinctive voice and perspective, J.D. Salinger offers readers a poignant and thought-provoking exploration of adolescence and the search for authenticity.",
        "totalPages": 224,
        "rating": 4.3,
        "category": "Literary Fiction",
        "tags": ["Coming-of-Age", "Teenage Angst"],
        "publisher": "Little, Brown and Company",
        "yearOfPublishing": 1951
    },
    {
        "bookId": 9,
        "bookName": "The Alchemist",
        "author": "Paulo Coelho",
        "image": "https://i.pinimg.com/736x/70/8c/59/708c59587e3bc18a1a118ced4c70ff3a.jpg",
        "review": "The Alchemist is a philosophical novel about following one's dreams and discovering the true meaning of life. Santiago, a young Andalusian shepherd, embarks on a journey to find a hidden treasure in the Egyptian pyramids. Along the way, he encounters a series of characters who impart wisdom and guidance, teaching him important lessons about courage, perseverance, and the interconnectedness of all things. As Santiago learns to listen to his heart and follow his dreams, he discovers that the true treasure lies not in material wealth but in the journey itself. With its timeless message of hope and inspiration, The Alchemist continues to resonate with readers around the world.",
        "totalPages": 208,
        "rating": 4.6,
        "category": "Philosophical Fiction",
        "tags": ["Adventure", "Personal Legend"],
        "publisher": "HarperCollins",
        "yearOfPublishing": 1988
    }
]